[
    {"id": 1, "name": "Redmi Note 10 pro", "price": "Price: 15,000 RS", "image": "https://images.unsplash.com/photo-1635434651542-bcd747240352?q=80&w=2564&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Polycarbonate Back design","breaf":"Details:- The Redmi Note 10 Pro builds on top of the limited Redmi Note 9 Pro 5G, also known as Mi 10i 5G in some markets, both released a few weeks ago. It offers a better HRR OLED screen but comes with the inferior Snapdragon 732G chip instead of the more premium Snapdragon 750G 5G. The rest is mostly the same - camera, speakers, battery, fast charging.Indeed, the new Redmi Note 10 Pro may not be packing the best mid-range SoC, but it sure impresses with an interesting quad-camera on the back. The main shooter uses a 108MP Samsung sensor, then comes the 8MP ultrawide snapper, followed by a 5MP cam with telemacro lens, and finally, there is a 2MP depth sensor.The other interesting bits about the Redmi Note 10 Pro include the dedicated symmetrical speakers - yet another feature that's not widely available even on the most expensive phones (the flagships usually favor hybrid setups). There is also a nicely fat battery with a 5,020mAh capacity that's capable of 33W fast charging, and the corresponding power adapter is included with the phone. Some people will appreciate the presence of NFC, FM radio, IR blaster, a 3.5mm jack, and the microSD expansion."},
    {"id": 2, "name": "Realme 5 Pro", "price":  "Price: 15,000 RS", "image": "https://images.unsplash.com/photo-1628581878580-0f39a950ad1b?q=80&w=2564&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Cutting Edge Design","breaf":"Details: Ah, the Realme 5 Pro. It's been what - five years? Three? Actually, it's been only one year and yet Realme is launching its fifth generation of smartphones. The maker has been trying to cater to users' every imaginable need and quite successfully at that. So, after the Realme X that brought us immersive AMOLED experience, let's meet the camera-centric Realme 5 Pro.It might have been just over a year, but we are glad Realme has found its MO - catchy designs, breezy performance, and good camera skillset. And it's been delivering those on unbelievably low prices ever since. The Realme 5 Pro doesn't lose focus on what's important either - there is the signature dazzling looks, the upper-tier Snapdragon 712 chip, and company's first quad-camera setup.Indeed, Realme has jumped from dual- straight to quad-camera arrangements. And the Realme 5 Pro setup is rather impressive with a 48MP primary, an 8MP ultrawide, a 2MP macro, and 2MP portrait snappers. Advanced 2x digital zoom is available thanks to the high-res primary, as well as Nightscape and Chroma boost modes."},
    {"id": 3, "name": "Realme X", "price": "Price: 17,000 Rs", "image": "https://images.unsplash.com/photo-1631871633283-31be5e55a29a?q=80&w=2574&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Segment first dual camera phone","breaf":"Details:- We've been there before - is it the letter 'X' or is it the Roman numeral for 10? Much like that previous time, there's a sort of a reasonable answer - the Realme X is the company's tenth smartphone. Even with the conditioning we already have from the iPhone Ten, we're still leaning towards an eX. Anyway, let's not focus on the naming and instead look at the phone that is the Realme X.For this anniversary model, Realme's added a bunch of goodies you won't find on any of the other 9 handsets in this quickly growing lineup. Chief among them is the OLED display - it's a first for the brand and it's a big, notchless, 6.53-inch FullHD+ one - a great place to start.The 'notchless' bit above indicates the second defining feature of the X - it's got a popup selfie cam tucked in the top frame. And, this being an OLED display, you can also have an under-it-fingerprint sensor.You'd also be pleased to find the Sony IMX586 48MP imager on the back of the X - not unlike a ton of competitors in the class.Here's a rundown of what else you'll find on the latest Realme."},
    {"id": 4, "name": "Realme Watch 2", "price":"Price: 3,000 RS", "image": "https://images.unsplash.com/photo-1602248145578-9e5bc50c77b3?w=800&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NXx8cmVhbG1lfGVufDB8fDB8fHww", "description": "Cristal clear Amoled display","breaf":"Details: The Realme Watch 2 is the follow-up to the Realme Watch, which launched in 2020 and firmly fits the cheap smartwatch profile.Now compatible with both Android and iOS devices, the Watch 2 sticks to a square design but now has for a more rectangular look. The screen is the same size and resolution, but feels like a step up in quality overall Features-wise, not a huge deal has changed. As a smartwatch, you can view notifications, control your phone camera, access music controls and view weather updates. As a fitness tracker, you can track your heart rate, measure blood oxygen levels and track sleep.There’s no built-in GPS still, but you do have connected GPS support to help accurately map outdoor exercise and activities. Realme has increased the number of dedicated sports modes from 14 to 90, though our experience of tracking workouts is very similar to the original. It definitely performs better as a basic fitness tracker.Improvements have been made in the battery department; Realme now promises well over a week of time in between charges, and in our tests the watch proved capable of delivering that.With the battle of the cheap smartwatches starting to hot up, the Watch 2 holds up reasonably well against the competition. You will though find more compelling sports tracking and design flourishes on something like the Amazfit Bip U Pro and the Xiaomi Mi Watch Lite."},
    {"id": 5, "name": "Poco M3", "price": "13000 Rs", "image": "https://images.unsplash.com/photo-1615215271299-608ada121f72?q=80&w=2680&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Killing Competition","breaf":"Details:- Forget iPhones, Galaxies, Redmis, and whatnot. Meet the hottest phone of the season - the Poco M3. Everyone's talking about this model by the Xiaomi-backed brand, and rightfully so. It has everything needed to become a bestseller - good looks, a nice screen, excellent battery, stereo speakers, and a nice camera setup. And all these goodies come with a cheap price tag! Poco is now an independent brand from Xiaomi though Xiaomi still manufactures everything that Poco designs. Even down to the software Poco phones run or the chargers they use - it all comes from Xiaomi, so the two brands' independence isn't as obvious, at least for now."},
    {"id": 6, "name": "iphone X", "price": "99,999 RS", "image": "https://plus.unsplash.com/premium_photo-1680458723013-d0a87694f16f?q=80&w=2574&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Worlds first Face unlock Device","breaf":"Details: The anniversary iPhone is here. The iPhone X. Or the iPhone 10. The name is as confusing as the product itself is game-changing. Tim Cook's vision finally overwhelmed Steve Jobs ideological remnants. A new dawn for the iPhones has begun, free of the iconic Home key and the notorious screen bezels.These past ten years of iPhones has contributed a lot to the industry's development - the capacitive touchscreen, the glass design, the fingerprint scanner, the force press, the portrait mode. We've seen Apple push the envelope each time by putting obscure technological breakthroughs in the hands of millions. And now they've done it yet again.The Face ID. Once a software gimmick, Apple has made it the next-step in biometric security. The company was so sure in its capabilities that it immediately retired the Touch ID. The Face ID sensor also made possible a new level of selfies and incredible accurate facial expression tracking with the Animojis. A little nudge capable of pushing the whole industry.And of course, the bezel-less screen. Dropping the huge bezels alone was enough, but Apple went all in with an all-screen for the iPhone X. Moreover, an AMOLED one, how about that?! Rightfully deserved, especially for a special edition smartphone such as the X. Or the 10. It takes time to get used to the sound of it. We're way more used to seeing the letter rather than the number when it comes to phone names through the years.The iPhone X gets the best of everything Apple and its providers have had in the lab. A new AMOLED HDR screen. A new steel frame. A new camera with dual optical stabilization. The best chipset on the market. A new front camera with depth-detection. Wireless charging. All that at the expense of a little notch."},
    {"id": 7, "name": "iphone Xs max", "price": "Price: 1,20,000 RS", "image": "https://images.unsplash.com/photo-1625123507485-36cbd6719438?q=80&w=2574&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Longer Battery Life","breaf":"Details: The iPhone X was not just a milestone for Apple. It also turned out to be the cornerstone the next generation of iPhones is being built around. And while the anniversary iPhone wowed everyone, many people voiced their wish for a Plus size model after the excitement had worn off. And this year Apple is righting this wrong with the iPhone XS Max.We have to admit we used all of our jokes on the iPhone XS review. But coming up with the iPhone XS Max name is probably the biggest joke anyway. Two letters, but one is a Roman numeral - we learned to deal with that. But the Max moniker after the XS name, well, this is funny everywhere on the globe.The iPhone XS Max is a wish come true for all of you who wanted an X Plus. The Max has a massive 6.5 inch bezel-less OLED display, the fastest chipset on the planet, an improved dual-camera, louder speakers, and the largest battery the iPhones have seen to date.The iPhone XS didn't seem to pack enough punch to make a reasonable iPhone user upgrade, but the Max is an entirely different story. If you wanted an X with a bigger screen you've probably pre-ordered and you have a tracking number in your mailbox already.Nobody doubted that a bigger iPhone would have costed more. But the iPhone XS Max is not just the most expensive iPhone yet. It's the most expensive smartphone there is right now. And despite what we'd expect, this didn't turn down the fans, quite the opposite - the iPhone XS Max is massively outselling the XS."},
    {"id": 8, "name": "Motorola Phone", "price": "Price: 7,000 RS", "image": "https://images.unsplash.com/photo-1614767464582-b23a647d835f?q=80&w=2535&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Best for old age persons","breaf":"Details:- The Motorola Aura was strikingly similar to the V70 a few years ago. But this quaint phone marked the entry into the elite world of high-end phones with a price tag of £1,400, putting even today's flagships to shame.The round screen and rotating design remain largely the same, but the build quality and materials make the Aura an incredibly desirable piece of pocket art.The screen had a 300ppi number filled with tons of pixels and was covered with a 62-carat sapphire crystal, one of the most complex materials. In other words, you can't ruin a day without diamonds.The rotating mechanism was also a remarkable engineering feat, featuring 130 ball bearings and 200 individual parts, including tungsten carbide-coated steel gears. It is the same one used in high-performance racing engines."},
    {"id": 9, "name": "Moto Razer V3", "price":"Price: 1,00,000", "image": "https://images.unsplash.com/photo-1614767464545-533644010662?q=80&w=2535&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Best Compact device of all time","breaf":"Details:- The Motorola RAZR V3, popularly called simply the Razr (pronounced / like razor, is a clamshell style cell phone developed by Motorola and initially released in November 2004, the first device using the RAZR moniker. With its unique and then-thin aluminium body, coupled with a high price, the RAZR V3 was initially positioned as a desirable premium phone; following price reductions, it then became extremely successful. In the United States the V3 (and its variants) was the most popular cell phone in 2005, 2006 and 2007[1] and remained best-selling until November 2008.[2][3]The Razr's design would strongly influence Motorola's later mobile phone products, and the V3 itself received several updates to form the RAZR line: the V3i, V3x, V3xx and MAXX. The Razr series was succeeded in July 2007 by the Motorola Razr2 series."},
    {"id": 10, "name": "Macbook Air", "price": "Price: 99,999 Rs", "image": "https://images.unsplash.com/photo-1606229365485-93a3b8ee0385?q=80&w=2574&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "No Cooler only Air","breaf":"Details: On the outside, the new MacBook Air is nearly identical to the Intel-based one Apple released earlier this year. It has the same well-loved wedge-shaped design, 2560 x 1600 screen that maxes out at 400 nits of brightness, Touch ID fingerprint login, reasonably good speakers, Apple's revised scissor-switch keyboard, and that massive trackpad.It also has the same starting price: $999 for a model with 8GB of RAM and 256GB of storage. That base model also has one less core on its graphics processor compared to pricier configurations, though I cant speak to what impact that might have. (I bet its not much.) The model Im testing has 16GB of RAM and 1TB of storage for $1,649. As before, you cant upgrade anything later on if you need to.There is only one exterior difference between the new one and the last model: Apple swapped out some of the buttons on the function row for more useful ones. Now, you get a button for Spotlight search (which, on macOS Big Sur, finally can do Google searches), Do Not Disturb, and Dictation. If, like me, you haven't used Dictation much before this, I think you'll be pleasantly surprised at how good it is.The other differences are all on the inside. There's no fan anymore, for one thing, just an aluminum heat spreader. But even when pushing this machine to its absolute limit, I never felt it get more than a little warm. Apple knows what the thermal ceiling for this system is, and it keeps the MacBook well within it.Unfortunately, that similarity extends to the webcam, which is still 720p resolution and still terrible. Apple has tried to borrow some of its real-time image processing from the iPhone to try to spruce up the image — and I do find that it does a better job evenly lighting my face — but mostly what I notice is that it looks bad (only now it's a more processed version of bad)."},
    {"id": 11, "name": "Macbook Pro", "price": "Price: 1,50,000 Rs", "image": "https://images.unsplash.com/photo-1588601515608-6a6814976b50?q=80&w=2574&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Details: Better Then You Think","breaf":"Details:- The screen is amazing. Its bright, the colours look nice, and I havent seen any glaring issues (aside from some literal glare). The 14″ only feels marginally smaller than the 15″ displays I had in my previous MacBooks.The bezels have also become much smaller. Consequently, the screen now has a notch: a small cut-out where the webcam resides. It's a bit more noticeable on the 14″ model, but you quickly get used to it. Most importantly, the notch doesn't take away any valuable screen estate. You still get your full 16:10 space below it.The battery usually lasts about six hours for me, which doesnt even come close to the advertised battery life. Its even less when I participate in Teams meetings with a Kandao 360° camera. Then again, I'm running heavy workloads in the background most of the time. Other laptops don't last more than two hours with this setup.With regard to weight, the 14″ model is small and light enough that it can be comfortably held with just one hand. It's perfect.The 16″ model on the other hand is massive. You'll want to hold it with both hands and you definitely don't want to carry it on your back all day long when you're on call."},
    {"id": 12, "name": "Macbook Pro M2", "price": "Price: 2,00,000 Rs", "image": "https://images.unsplash.com/photo-1525547719571-a2d4ac8945e2?q=80&w=2564&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "With the most powerfull processor of all time yet","breaf":"Details:- Apple announced the new M2 MacBook Air one year ago at WWDC22, which launched a month later on July 15, 2022. At the time of the M2 Airs announcement, I was already smitten with the M1 MacBook Air. The blend of power, fanless build, exceptional battery life, and thin and light design helped it become the perfect laptop for my needs. The M2 was an elevation on these characteristics, with a 20% more powerful processor and reimagined chassis, which somehow became lighter than the previous version; I was thrilled. And over the past year, I've come to adore this laptop more and more and wanted to share some of my experiences over the past 365 days.I purchased the 13.6-inch M2 MacBook Air specced with the 8-core CPU, 10-core GPU, 1TB SSD, and 16GB RAM. And with Apple's educator pricing discount and back-to-school promotion running at the time, I managed to get this config at $400 off on launch day. I also purchased the Air in Starlight. Initially, I was all eyes for the stunning Midnight MacBook Air. Still, I shied away from it, not because it was an icky fingerprint magnet (it is), but because I knew that I would fixate on any ding or chip on the product as the raw aluminum would be infinitely more visible on Midnight than on any of the other three colours. My second choice was to get Silver, but my preferred configuration above wasn't available in-store, so I opted for my third choice, Starlight, which was.I am so happy I went with Starlight. At first, I was skeptical that it might look gaudy or dirty, but Starlight occurs as a warm silver laptop in nearly all lighting conditions. I'd frequently mistake it for Silver until I placed it next to another silver product; only then would differences become apparent. I can understand how the subtly of this shade made it less appealing to people who enjoyed some of Apple's bolder gold variations over the years, but I've come to adore Starlight. Without question, a sleeper hit!"},
    {"id": 13, "name": "Samsung Galaxy Note 20", "price": "Price: 1,00,000", "image": "https://images.unsplash.com/photo-1597762470488-3877b1f538c6?q=80&w=2680&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Magic of S-Pen","breaf":"Details:- Last year, in a one-off effort, Samsung put out the Note10 and Note10+ - a relatively closely-specced pair where size was really the key factor for picking one over the other. Not so this time around. The Note20 Ultra and Note20 are both big and feature parity is out the door - in a similar fashion to how the S20 Ultra is above and beyond the S20+, only even more so.Pounding on the Note20 in absentia isn't what we're here for and we'll deal with its shortcomings and limitations when one shows up at our doorstep. For now, let's focus on the Ultra.First appearing on the other S20 Ultra, the oversized camera hump makes a return on the Note20 Ultra. Most of the bits inside are the same, including the main 108MP cam and the 12MP ultra wide. But the periscope telephoto that's in part responsible for the sheer size of the assembly is now 12MP, swapping out the 48MP unit of the S-series phone - we'll have to see about that.The display is a nice marriage of Note-style geometry with some high refresh rate coming in from the S20s, now supposedly made even better with an adaptive refresh rate adjustment. Oh, and spoiler - it's the brightest AMOLED screen we've seen to date.The S Pen is here, of course, now relocated to the left side. It's improved too, getting a 9ms latency (down more than 4 times compared to the Note10), system-wide Air actions, and a Notes app to make you forget Google Keep.All this comes in a redesigned package featuring a stainless steel midframe where once was aluminum and the brand new Gorilla Glass 7 (aka Victus) for improved durability. For improved looks, the matte finish on the back will ward off fingerprints, though only the Mystic Bronze color option gets that treatment, sadly. The Mystic Black is all shiny."},
    {"id": 14, "name": "Macbook Pro M1", "price":"Price: 1,50,000 Rs", "image": "https://images.unsplash.com/photo-1541807084-5c52b6b3adef?w=800&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8bWFjYm9va3xlbnwwfHwwfHx8MA%3D%3D", "description": "Perfect Laptop for coding","breaf":"Details:- The screen is amazing. Its bright, the colours look nice, and I havent seen any glaring issues (aside from some literal glare). The 14″ only feels marginally smaller than the 15″ displays I had in my previous MacBooks.The bezels have also become much smaller. Consequently, the screen now has a notch: a small cut-out where the webcam resides. It's a bit more noticeable on the 14″ model, but you quickly get used to it. Most importantly, the notch doesn't take away any valuable screen estate. You still get your full 16:10 space below it.The battery usually lasts about six hours for me, which doesnt even come close to the advertised battery life. Its even less when I participate in Teams meetings with a Kandao 360° camera. Then again, I'm running heavy workloads in the background most of the time. Other laptops don't last more than two hours with this setup.With regard to weight, the 14″ model is small and light enough that it can be comfortably held with just one hand. It's perfect.The 16″ model on the other hand is massive. You'll want to hold it with both hands and you definitely don't want to carry it on your back all day long when you're on call."},
    {"id": 15, "name": "Apple Airpods", "price": "Price: 10,000 Rs", "image": "https://images.unsplash.com/photo-1592921870583-aeafb0639ffe?w=800&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8YWlyJTIwcG9kc3xlbnwwfHwwfHx8MA%3D%3D", "description": "Best Active Noice Cancellation TWS","breaf":"Details:- Apple is known for their classy products and AirPods has proven to be one of them for rich sound. I have been using Bose earlier bcoz I'm music enthusiast but also I wanted to give a try for completely wireless experience. Sure there are other products out there and you may first compare different brands before coming to final conclusion. But if you're first choice is comfort and true sound then this is the product you should go for. You won't even feel if AirPods are in your ear, and it's like you pull the AirPods out of the case and there it goes without going into all hustle of connecting and disconnecting via Bluetooth. Batter backup is amazing with wireless case but bass can be improved. Sounds quality is really awesome and it's obviously different from what you already get with those old wired earphones in newly purchased iPhone box. I still feel it's a little bit pricy but it makes life so much easier. It's easy to connect via iPhone when you're into Apple to Apple ecosystem. Although they should have introduced more colours like black. If you already own AirPods then there is no need to upgrade but if you wish you own a separate wireless charging case then you can buy separately but if you are coming from old school wired earphones to completely wireless experience then AirPods is best choice. There are also other good wireless (Headphones) that may offer noise cancelling features but Airpods is light and easy to carry when you're traveling."},
    {"id": 16, "name": "Samsung Galaxy M31s", "price": "Price: 20,000 Rs", "image": "https://images.unsplash.com/photo-1609252924198-30b8cb324d2b?q=80&w=2574&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D", "description": "Biggest Battery Smartphone","breaf":"Details- Good Phone. Great considering the price. Apart from refresh rate, doesn't feel much different modern day flagships.Design is just right, subtle yet flamboyant . Light polycarbonate but still manages to look like metal. Not heavy, nice form factor - almost bessel free too.Display is one of the best I've ever seen. Color mode: Vivid. Tone: Warm. Looks like a charm! Primary camera is quite good both in sun and low light. Different modes yet to test. Camera is AI enabled - even an amateur will capture legendary shots with it's suggestionsProcessor does not lag once the phone is fully set up internally (which takes a couple of hours if you smart switch from your old samsung). Before that is heats up and struggles a bit.Knox is there and got secure folder after updating the software - unlike what many youtubers say.Sound is rich with good amounts of bass and clarity, but it does crack a bit at the highest volume.All in all, a very satisfying purchase to be frank."}      
  ]